###############################################################################
# Created by write_sdc
# Thu Jun  6 10:09:42 2024
###############################################################################
current_design execution_unit
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {wb_clk_i}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_clock_latency -source -min 4.6500 [get_clocks {clk}]
set_clock_latency -source -max 5.5700 [get_clocks {clk}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1900 [get_ports {busy}]
set_load -pin_load 0.1900 [get_ports {dest_pred_val}]
set_load -pin_load 0.1900 [get_ports {int_return}]
set_load -pin_load 0.1900 [get_ports {is_load}]
set_load -pin_load 0.1900 [get_ports {is_store}]
set_load -pin_load 0.1900 [get_ports {sign_extend}]
set_load -pin_load 0.1900 [get_ports {take_branch}]
set_load -pin_load 0.1900 [get_ports {dest_idx[5]}]
set_load -pin_load 0.1900 [get_ports {dest_idx[4]}]
set_load -pin_load 0.1900 [get_ports {dest_idx[3]}]
set_load -pin_load 0.1900 [get_ports {dest_idx[2]}]
set_load -pin_load 0.1900 [get_ports {dest_idx[1]}]
set_load -pin_load 0.1900 [get_ports {dest_idx[0]}]
set_load -pin_load 0.1900 [get_ports {dest_mask[1]}]
set_load -pin_load 0.1900 [get_ports {dest_mask[0]}]
set_load -pin_load 0.1900 [get_ports {dest_pred[2]}]
set_load -pin_load 0.1900 [get_ports {dest_pred[1]}]
set_load -pin_load 0.1900 [get_ports {dest_pred[0]}]
set_load -pin_load 0.1900 [get_ports {dest_val[31]}]
set_load -pin_load 0.1900 [get_ports {dest_val[30]}]
set_load -pin_load 0.1900 [get_ports {dest_val[29]}]
set_load -pin_load 0.1900 [get_ports {dest_val[28]}]
set_load -pin_load 0.1900 [get_ports {dest_val[27]}]
set_load -pin_load 0.1900 [get_ports {dest_val[26]}]
set_load -pin_load 0.1900 [get_ports {dest_val[25]}]
set_load -pin_load 0.1900 [get_ports {dest_val[24]}]
set_load -pin_load 0.1900 [get_ports {dest_val[23]}]
set_load -pin_load 0.1900 [get_ports {dest_val[22]}]
set_load -pin_load 0.1900 [get_ports {dest_val[21]}]
set_load -pin_load 0.1900 [get_ports {dest_val[20]}]
set_load -pin_load 0.1900 [get_ports {dest_val[19]}]
set_load -pin_load 0.1900 [get_ports {dest_val[18]}]
set_load -pin_load 0.1900 [get_ports {dest_val[17]}]
set_load -pin_load 0.1900 [get_ports {dest_val[16]}]
set_load -pin_load 0.1900 [get_ports {dest_val[15]}]
set_load -pin_load 0.1900 [get_ports {dest_val[14]}]
set_load -pin_load 0.1900 [get_ports {dest_val[13]}]
set_load -pin_load 0.1900 [get_ports {dest_val[12]}]
set_load -pin_load 0.1900 [get_ports {dest_val[11]}]
set_load -pin_load 0.1900 [get_ports {dest_val[10]}]
set_load -pin_load 0.1900 [get_ports {dest_val[9]}]
set_load -pin_load 0.1900 [get_ports {dest_val[8]}]
set_load -pin_load 0.1900 [get_ports {dest_val[7]}]
set_load -pin_load 0.1900 [get_ports {dest_val[6]}]
set_load -pin_load 0.1900 [get_ports {dest_val[5]}]
set_load -pin_load 0.1900 [get_ports {dest_val[4]}]
set_load -pin_load 0.1900 [get_ports {dest_val[3]}]
set_load -pin_load 0.1900 [get_ports {dest_val[2]}]
set_load -pin_load 0.1900 [get_ports {dest_val[1]}]
set_load -pin_load 0.1900 [get_ports {dest_val[0]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[31]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[30]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[29]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[28]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[27]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[26]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[25]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[24]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[23]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[22]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[21]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[20]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[19]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[18]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[17]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[16]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[15]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[14]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[13]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[12]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[11]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[10]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[9]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[8]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[7]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[6]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[5]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[4]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[3]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[2]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[1]}]
set_load -pin_load 0.1900 [get_ports {loadstore_address[0]}]
set_load -pin_load 0.1900 [get_ports {loadstore_size[1]}]
set_load -pin_load 0.1900 [get_ports {loadstore_size[0]}]
set_load -pin_load 0.1900 [get_ports {new_PC[27]}]
set_load -pin_load 0.1900 [get_ports {new_PC[26]}]
set_load -pin_load 0.1900 [get_ports {new_PC[25]}]
set_load -pin_load 0.1900 [get_ports {new_PC[24]}]
set_load -pin_load 0.1900 [get_ports {new_PC[23]}]
set_load -pin_load 0.1900 [get_ports {new_PC[22]}]
set_load -pin_load 0.1900 [get_ports {new_PC[21]}]
set_load -pin_load 0.1900 [get_ports {new_PC[20]}]
set_load -pin_load 0.1900 [get_ports {new_PC[19]}]
set_load -pin_load 0.1900 [get_ports {new_PC[18]}]
set_load -pin_load 0.1900 [get_ports {new_PC[17]}]
set_load -pin_load 0.1900 [get_ports {new_PC[16]}]
set_load -pin_load 0.1900 [get_ports {new_PC[15]}]
set_load -pin_load 0.1900 [get_ports {new_PC[14]}]
set_load -pin_load 0.1900 [get_ports {new_PC[13]}]
set_load -pin_load 0.1900 [get_ports {new_PC[12]}]
set_load -pin_load 0.1900 [get_ports {new_PC[11]}]
set_load -pin_load 0.1900 [get_ports {new_PC[10]}]
set_load -pin_load 0.1900 [get_ports {new_PC[9]}]
set_load -pin_load 0.1900 [get_ports {new_PC[8]}]
set_load -pin_load 0.1900 [get_ports {new_PC[7]}]
set_load -pin_load 0.1900 [get_ports {new_PC[6]}]
set_load -pin_load 0.1900 [get_ports {new_PC[5]}]
set_load -pin_load 0.1900 [get_ports {new_PC[4]}]
set_load -pin_load 0.1900 [get_ports {new_PC[3]}]
set_load -pin_load 0.1900 [get_ports {new_PC[2]}]
set_load -pin_load 0.1900 [get_ports {new_PC[1]}]
set_load -pin_load 0.1900 [get_ports {new_PC[0]}]
set_load -pin_load 0.1900 [get_ports {pred_idx[2]}]
set_load -pin_load 0.1900 [get_ports {pred_idx[1]}]
set_load -pin_load 0.1900 [get_ports {pred_idx[0]}]
set_load -pin_load 0.1900 [get_ports {reg1_idx[5]}]
set_load -pin_load 0.1900 [get_ports {reg1_idx[4]}]
set_load -pin_load 0.1900 [get_ports {reg1_idx[3]}]
set_load -pin_load 0.1900 [get_ports {reg1_idx[2]}]
set_load -pin_load 0.1900 [get_ports {reg1_idx[1]}]
set_load -pin_load 0.1900 [get_ports {reg1_idx[0]}]
set_load -pin_load 0.1900 [get_ports {reg2_idx[5]}]
set_load -pin_load 0.1900 [get_ports {reg2_idx[4]}]
set_load -pin_load 0.1900 [get_ports {reg2_idx[3]}]
set_load -pin_load 0.1900 [get_ports {reg2_idx[2]}]
set_load -pin_load 0.1900 [get_ports {reg2_idx[1]}]
set_load -pin_load 0.1900 [get_ports {reg2_idx[0]}]
set_input_transition 0.6100 [get_ports {wb_clk_i}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 1.0000 [current_design]
set_max_fanout 16.0000 [current_design]
