###############################################################################
# Created by write_sdc
# Fri May 31 23:33:46 2024
###############################################################################
current_design vliw
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {wb_clk_i}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_clock_latency -source -min 4.6500 [get_clocks {clk}]
set_clock_latency -source -max 5.5700 [get_clocks {clk}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[0]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[10]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[10]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[11]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[11]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[12]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[12]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[13]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[13]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[14]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[14]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[15]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[15]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[16]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[16]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[17]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[17]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[18]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[18]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[19]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[19]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[1]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[20]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[20]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[21]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[21]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[22]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[22]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[23]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[23]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[24]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[24]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[25]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[25]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[26]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[26]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[27]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[27]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[28]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[28]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[29]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[29]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[2]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[2]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[30]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[30]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[31]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[31]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[3]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[3]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[4]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[4]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[5]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[5]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[6]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[6]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[7]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[7]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[8]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[8]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val0[9]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val0[9]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[0]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[10]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[10]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[11]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[11]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[12]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[12]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[13]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[13]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[14]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[14]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[15]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[15]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[16]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[16]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[17]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[17]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[18]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[18]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[19]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[19]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[1]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[20]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[20]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[21]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[21]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[22]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[22]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[23]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[23]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[24]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[24]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[25]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[25]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[26]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[26]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[27]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[27]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[28]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[28]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[29]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[29]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[2]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[2]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[30]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[30]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[31]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[31]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[3]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[3]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[4]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[4]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[5]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[5]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[6]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[6]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[7]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[7]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[8]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[8]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val1[9]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val1[9]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[0]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[10]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[10]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[11]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[11]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[12]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[12]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[13]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[13]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[14]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[14]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[15]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[15]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[16]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[16]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[17]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[17]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[18]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[18]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[19]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[19]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[1]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[20]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[20]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[21]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[21]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[22]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[22]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[23]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[23]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[24]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[24]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[25]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[25]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[26]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[26]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[27]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[27]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[28]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[28]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[29]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[29]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[2]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[2]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[30]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[30]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[31]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[31]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[3]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[3]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[4]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[4]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[5]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[5]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[6]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[6]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[7]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[7]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[8]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[8]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {dest_val2[9]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {dest_val2[9]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC0[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC0[0]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC0[10]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC0[10]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC0[11]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC0[11]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC0[12]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC0[12]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC0[13]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC0[13]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC0[14]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC0[14]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC0[15]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC0[15]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC0[16]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC0[16]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC0[17]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC0[17]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC0[18]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC0[18]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC0[19]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC0[19]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC0[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC0[1]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC0[20]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC0[20]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC0[21]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC0[21]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC0[22]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC0[22]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC0[23]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC0[23]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC0[24]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC0[24]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC0[25]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC0[25]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC0[26]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC0[26]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC0[27]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC0[27]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC0[2]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC0[2]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC0[3]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC0[3]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC0[4]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC0[4]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC0[5]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC0[5]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC0[6]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC0[6]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC0[7]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC0[7]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC0[8]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC0[8]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC0[9]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC0[9]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC1[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC1[0]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC1[10]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC1[10]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC1[11]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC1[11]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC1[12]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC1[12]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC1[13]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC1[13]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC1[14]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC1[14]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC1[15]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC1[15]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC1[16]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC1[16]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC1[17]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC1[17]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC1[18]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC1[18]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC1[19]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC1[19]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC1[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC1[1]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC1[20]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC1[20]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC1[21]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC1[21]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC1[22]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC1[22]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC1[23]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC1[23]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC1[24]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC1[24]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC1[25]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC1[25]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC1[26]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC1[26]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC1[27]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC1[27]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC1[2]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC1[2]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC1[3]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC1[3]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC1[4]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC1[4]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC1[5]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC1[5]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC1[6]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC1[6]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC1[7]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC1[7]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC1[8]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC1[8]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC1[9]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC1[9]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC2[0]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC2[0]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC2[10]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC2[10]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC2[11]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC2[11]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC2[12]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC2[12]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC2[13]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC2[13]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC2[14]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC2[14]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC2[15]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC2[15]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC2[16]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC2[16]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC2[17]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC2[17]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC2[18]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC2[18]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC2[19]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC2[19]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC2[1]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC2[1]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC2[20]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC2[20]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC2[21]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC2[21]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC2[22]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC2[22]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC2[23]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC2[23]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC2[24]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC2[24]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC2[25]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC2[25]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC2[26]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC2[26]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC2[27]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC2[27]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC2[2]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC2[2]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC2[3]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC2[3]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC2[4]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC2[4]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC2[5]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC2[5]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC2[6]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC2[6]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC2[7]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC2[7]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC2[8]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC2[8]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {new_PC2[9]}]
set_input_delay 20.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {new_PC2[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1900 [get_ports {pred_val0}]
set_load -pin_load 0.1900 [get_ports {pred_val1}]
set_load -pin_load 0.1900 [get_ports {pred_val2}]
set_load -pin_load 0.1900 [get_ports {rst_eu}]
set_load -pin_load 0.1900 [get_ports {curr_PC[27]}]
set_load -pin_load 0.1900 [get_ports {curr_PC[26]}]
set_load -pin_load 0.1900 [get_ports {curr_PC[25]}]
set_load -pin_load 0.1900 [get_ports {curr_PC[24]}]
set_load -pin_load 0.1900 [get_ports {curr_PC[23]}]
set_load -pin_load 0.1900 [get_ports {curr_PC[22]}]
set_load -pin_load 0.1900 [get_ports {curr_PC[21]}]
set_load -pin_load 0.1900 [get_ports {curr_PC[20]}]
set_load -pin_load 0.1900 [get_ports {curr_PC[19]}]
set_load -pin_load 0.1900 [get_ports {curr_PC[18]}]
set_load -pin_load 0.1900 [get_ports {curr_PC[17]}]
set_load -pin_load 0.1900 [get_ports {curr_PC[16]}]
set_load -pin_load 0.1900 [get_ports {curr_PC[15]}]
set_load -pin_load 0.1900 [get_ports {curr_PC[14]}]
set_load -pin_load 0.1900 [get_ports {curr_PC[13]}]
set_load -pin_load 0.1900 [get_ports {curr_PC[12]}]
set_load -pin_load 0.1900 [get_ports {curr_PC[11]}]
set_load -pin_load 0.1900 [get_ports {curr_PC[10]}]
set_load -pin_load 0.1900 [get_ports {curr_PC[9]}]
set_load -pin_load 0.1900 [get_ports {curr_PC[8]}]
set_load -pin_load 0.1900 [get_ports {curr_PC[7]}]
set_load -pin_load 0.1900 [get_ports {curr_PC[6]}]
set_load -pin_load 0.1900 [get_ports {curr_PC[5]}]
set_load -pin_load 0.1900 [get_ports {curr_PC[4]}]
set_load -pin_load 0.1900 [get_ports {curr_PC[3]}]
set_load -pin_load 0.1900 [get_ports {curr_PC[2]}]
set_load -pin_load 0.1900 [get_ports {curr_PC[1]}]
set_load -pin_load 0.1900 [get_ports {curr_PC[0]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[41]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[40]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[39]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[38]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[37]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[36]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[35]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[34]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[33]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[32]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[31]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[30]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[29]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[28]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[27]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[26]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[25]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[24]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[23]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[22]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[21]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[20]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[19]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[18]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[17]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[16]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[15]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[14]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[13]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[12]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[11]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[10]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[9]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[8]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[7]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[6]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[5]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[4]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[3]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[2]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[1]}]
set_load -pin_load 0.1900 [get_ports {eu0_instruction[0]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[41]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[40]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[39]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[38]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[37]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[36]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[35]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[34]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[33]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[32]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[31]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[30]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[29]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[28]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[27]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[26]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[25]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[24]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[23]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[22]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[21]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[20]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[19]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[18]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[17]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[16]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[15]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[14]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[13]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[12]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[11]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[10]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[9]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[8]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[7]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[6]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[5]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[4]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[3]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[2]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[1]}]
set_load -pin_load 0.1900 [get_ports {eu1_instruction[0]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[41]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[40]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[39]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[38]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[37]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[36]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[35]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[34]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[33]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[32]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[31]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[30]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[29]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[28]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[27]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[26]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[25]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[24]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[23]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[22]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[21]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[20]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[19]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[18]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[17]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[16]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[15]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[14]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[13]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[12]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[11]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[10]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[9]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[8]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[7]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[6]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[5]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[4]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[3]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[2]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[1]}]
set_load -pin_load 0.1900 [get_ports {eu2_instruction[0]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[35]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[34]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[33]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[32]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[31]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[30]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[29]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[28]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[27]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[26]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[25]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[24]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[23]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[22]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[21]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[20]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[19]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[18]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[17]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[16]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[15]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[14]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[13]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[12]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[11]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[10]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[9]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[8]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[7]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[6]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[5]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[4]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[3]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[2]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[1]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[0]}]
set_load -pin_load 0.1900 [get_ports {io_out[35]}]
set_load -pin_load 0.1900 [get_ports {io_out[34]}]
set_load -pin_load 0.1900 [get_ports {io_out[33]}]
set_load -pin_load 0.1900 [get_ports {io_out[32]}]
set_load -pin_load 0.1900 [get_ports {io_out[31]}]
set_load -pin_load 0.1900 [get_ports {io_out[30]}]
set_load -pin_load 0.1900 [get_ports {io_out[29]}]
set_load -pin_load 0.1900 [get_ports {io_out[28]}]
set_load -pin_load 0.1900 [get_ports {io_out[27]}]
set_load -pin_load 0.1900 [get_ports {io_out[26]}]
set_load -pin_load 0.1900 [get_ports {io_out[25]}]
set_load -pin_load 0.1900 [get_ports {io_out[24]}]
set_load -pin_load 0.1900 [get_ports {io_out[23]}]
set_load -pin_load 0.1900 [get_ports {io_out[22]}]
set_load -pin_load 0.1900 [get_ports {io_out[21]}]
set_load -pin_load 0.1900 [get_ports {io_out[20]}]
set_load -pin_load 0.1900 [get_ports {io_out[19]}]
set_load -pin_load 0.1900 [get_ports {io_out[18]}]
set_load -pin_load 0.1900 [get_ports {io_out[17]}]
set_load -pin_load 0.1900 [get_ports {io_out[16]}]
set_load -pin_load 0.1900 [get_ports {io_out[15]}]
set_load -pin_load 0.1900 [get_ports {io_out[14]}]
set_load -pin_load 0.1900 [get_ports {io_out[13]}]
set_load -pin_load 0.1900 [get_ports {io_out[12]}]
set_load -pin_load 0.1900 [get_ports {io_out[11]}]
set_load -pin_load 0.1900 [get_ports {io_out[10]}]
set_load -pin_load 0.1900 [get_ports {io_out[9]}]
set_load -pin_load 0.1900 [get_ports {io_out[8]}]
set_load -pin_load 0.1900 [get_ports {io_out[7]}]
set_load -pin_load 0.1900 [get_ports {io_out[6]}]
set_load -pin_load 0.1900 [get_ports {io_out[5]}]
set_load -pin_load 0.1900 [get_ports {io_out[4]}]
set_load -pin_load 0.1900 [get_ports {io_out[3]}]
set_load -pin_load 0.1900 [get_ports {io_out[2]}]
set_load -pin_load 0.1900 [get_ports {io_out[1]}]
set_load -pin_load 0.1900 [get_ports {io_out[0]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[31]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[30]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[29]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[28]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[27]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[26]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[25]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[24]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[23]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[22]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[21]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[20]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[19]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[18]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[17]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[16]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[15]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[14]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[13]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[12]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[11]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[10]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[9]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[8]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[7]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[6]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[5]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[4]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[3]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[2]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[1]}]
set_load -pin_load 0.1900 [get_ports {reg1_val0[0]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[31]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[30]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[29]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[28]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[27]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[26]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[25]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[24]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[23]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[22]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[21]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[20]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[19]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[18]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[17]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[16]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[15]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[14]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[13]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[12]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[11]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[10]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[9]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[8]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[7]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[6]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[5]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[4]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[3]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[2]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[1]}]
set_load -pin_load 0.1900 [get_ports {reg1_val1[0]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[31]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[30]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[29]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[28]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[27]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[26]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[25]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[24]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[23]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[22]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[21]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[20]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[19]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[18]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[17]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[16]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[15]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[14]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[13]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[12]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[11]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[10]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[9]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[8]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[7]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[6]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[5]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[4]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[3]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[2]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[1]}]
set_load -pin_load 0.1900 [get_ports {reg1_val2[0]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[31]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[30]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[29]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[28]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[27]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[26]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[25]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[24]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[23]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[22]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[21]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[20]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[19]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[18]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[17]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[16]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[15]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[14]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[13]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[12]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[11]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[10]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[9]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[8]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[7]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[6]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[5]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[4]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[3]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[2]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[1]}]
set_load -pin_load 0.1900 [get_ports {reg2_val0[0]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[31]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[30]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[29]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[28]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[27]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[26]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[25]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[24]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[23]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[22]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[21]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[20]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[19]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[18]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[17]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[16]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[15]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[14]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[13]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[12]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[11]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[10]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[9]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[8]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[7]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[6]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[5]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[4]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[3]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[2]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[1]}]
set_load -pin_load 0.1900 [get_ports {reg2_val1[0]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[31]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[30]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[29]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[28]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[27]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[26]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[25]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[24]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[23]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[22]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[21]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[20]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[19]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[18]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[17]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[16]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[15]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[14]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[13]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[12]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[11]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[10]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[9]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[8]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[7]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[6]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[5]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[4]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[3]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[2]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[1]}]
set_load -pin_load 0.1900 [get_ports {reg2_val2[0]}]
set_input_transition 0.6100 [get_ports {wb_clk_i}]
set_input_transition -min 0.0500 [get_ports {io_in[35]}]
set_input_transition -max 0.3800 [get_ports {io_in[35]}]
set_input_transition -min 0.0500 [get_ports {io_in[34]}]
set_input_transition -max 0.3800 [get_ports {io_in[34]}]
set_input_transition -min 0.0500 [get_ports {io_in[33]}]
set_input_transition -max 0.3800 [get_ports {io_in[33]}]
set_input_transition -min 0.0500 [get_ports {io_in[32]}]
set_input_transition -max 0.3800 [get_ports {io_in[32]}]
set_input_transition -min 0.0500 [get_ports {io_in[31]}]
set_input_transition -max 0.3800 [get_ports {io_in[31]}]
set_input_transition -min 0.0500 [get_ports {io_in[30]}]
set_input_transition -max 0.3800 [get_ports {io_in[30]}]
set_input_transition -min 0.0500 [get_ports {io_in[29]}]
set_input_transition -max 0.3800 [get_ports {io_in[29]}]
set_input_transition -min 0.0500 [get_ports {io_in[28]}]
set_input_transition -max 0.3800 [get_ports {io_in[28]}]
set_input_transition -min 0.0500 [get_ports {io_in[27]}]
set_input_transition -max 0.3800 [get_ports {io_in[27]}]
set_input_transition -min 0.0500 [get_ports {io_in[26]}]
set_input_transition -max 0.3800 [get_ports {io_in[26]}]
set_input_transition -min 0.0500 [get_ports {io_in[25]}]
set_input_transition -max 0.3800 [get_ports {io_in[25]}]
set_input_transition -min 0.0500 [get_ports {io_in[24]}]
set_input_transition -max 0.3800 [get_ports {io_in[24]}]
set_input_transition -min 0.0500 [get_ports {io_in[23]}]
set_input_transition -max 0.3800 [get_ports {io_in[23]}]
set_input_transition -min 0.0500 [get_ports {io_in[22]}]
set_input_transition -max 0.3800 [get_ports {io_in[22]}]
set_input_transition -min 0.0500 [get_ports {io_in[21]}]
set_input_transition -max 0.3800 [get_ports {io_in[21]}]
set_input_transition -min 0.0500 [get_ports {io_in[20]}]
set_input_transition -max 0.3800 [get_ports {io_in[20]}]
set_input_transition -min 0.0500 [get_ports {io_in[19]}]
set_input_transition -max 0.3800 [get_ports {io_in[19]}]
set_input_transition -min 0.0500 [get_ports {io_in[18]}]
set_input_transition -max 0.3800 [get_ports {io_in[18]}]
set_input_transition -min 0.0500 [get_ports {io_in[17]}]
set_input_transition -max 0.3800 [get_ports {io_in[17]}]
set_input_transition -min 0.0500 [get_ports {io_in[16]}]
set_input_transition -max 0.3800 [get_ports {io_in[16]}]
set_input_transition -min 0.0500 [get_ports {io_in[15]}]
set_input_transition -max 0.3800 [get_ports {io_in[15]}]
set_input_transition -min 0.0500 [get_ports {io_in[14]}]
set_input_transition -max 0.3800 [get_ports {io_in[14]}]
set_input_transition -min 0.0500 [get_ports {io_in[13]}]
set_input_transition -max 0.3800 [get_ports {io_in[13]}]
set_input_transition -min 0.0500 [get_ports {io_in[12]}]
set_input_transition -max 0.3800 [get_ports {io_in[12]}]
set_input_transition -min 0.0500 [get_ports {io_in[11]}]
set_input_transition -max 0.3800 [get_ports {io_in[11]}]
set_input_transition -min 0.0500 [get_ports {io_in[10]}]
set_input_transition -max 0.3800 [get_ports {io_in[10]}]
set_input_transition -min 0.0500 [get_ports {io_in[9]}]
set_input_transition -max 0.3800 [get_ports {io_in[9]}]
set_input_transition -min 0.0500 [get_ports {io_in[8]}]
set_input_transition -max 0.3800 [get_ports {io_in[8]}]
set_input_transition -min 0.0500 [get_ports {io_in[7]}]
set_input_transition -max 0.3800 [get_ports {io_in[7]}]
set_input_transition -min 0.0500 [get_ports {io_in[6]}]
set_input_transition -max 0.3800 [get_ports {io_in[6]}]
set_input_transition -min 0.0500 [get_ports {io_in[5]}]
set_input_transition -max 0.3800 [get_ports {io_in[5]}]
set_input_transition -min 0.0500 [get_ports {io_in[4]}]
set_input_transition -max 0.3800 [get_ports {io_in[4]}]
set_input_transition -min 0.0500 [get_ports {io_in[3]}]
set_input_transition -max 0.3800 [get_ports {io_in[3]}]
set_input_transition -min 0.0500 [get_ports {io_in[2]}]
set_input_transition -max 0.3800 [get_ports {io_in[2]}]
set_input_transition -min 0.0500 [get_ports {io_in[1]}]
set_input_transition -max 0.3800 [get_ports {io_in[1]}]
set_input_transition -min 0.0500 [get_ports {io_in[0]}]
set_input_transition -max 0.3800 [get_ports {io_in[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 1.0000 [current_design]
set_max_fanout 16.0000 [current_design]
